In [3]:
import pandas as pd
import numpy as np

In [63]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [64]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [65]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [66]:
df[['First','Last']] = df.From_To.str.split("_",expand=True) ## breaking colums "From_To" into two diff columns from,To

In [67]:
df.drop('From_To', axis=1, inplace=True) ## dropping From_To

In [68]:
df

   FlightNumber  RecentDelays              Airline     First       Last
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1           NaN            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [69]:
df['FlightNumber'] = df['FlightNumber'].astype(float)

In [46]:
df

   FlightNumber  RecentDelays              Airline     First       Last
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1           NaN            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [70]:
df.dtypes

FlightNumber    float64
RecentDelays     object
Airline          object
First            object
Last             object
dtype: object

In [55]:
df

   FlightNumber  RecentDelays              Airline     First       Last
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1           NaN            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [71]:
df.First=df.First.str.title() ## standardising the string column

In [72]:
df.Last=df.Last.str.title()

In [73]:
df

   FlightNumber  RecentDelays              Airline     First       Last
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [81]:
df.RecentDelays[0][1]

47

In [94]:
len(df.RecentDelays[1])

0

In [121]:
k=pd.DataFrame(df["RecentDelays"].to_list(), columns=['Delay1', 'Delay2','Delay3'])
k

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [122]:
dat1 = pd.concat([df, k], axis=1)
dat1

,FlightNumber,RecentDelays,Airline,First,Last,Delay1,Delay2,Delay3
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,NaN,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,NaN,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [124]:
dat1.drop('RecentDelays' , axis=1)

,FlightNumber,Airline,First,Last,Delay1,Delay2,Delay3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,NaN,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,NaN,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [145]:
for i in np.arange(0, dat1.First.count()): ### filling the na's in FlightNumber 
     if pd.isnull(df.FlightNumber.loc[i,]): 
            dat1.loc[i,'FlightNumber']=dat1.FlightNumber.loc[i-1, ] + 10
dat1['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [147]:
dat1

,FlightNumber,RecentDelays,Airline,First,Last,Delay1,Delay2,Delay3
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [156]:
dat1.dtypes

FlightNumber    float64
RecentDelays     object
Airline          object
First            object
Last             object
Delay1          float64
Delay2          float64
Delay3          float64
dtype: object